АлогистикТест2/src/DataProcessors/алк_ПодборПакетов/алк_ПодборПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_ПодборПакетов</name>
  <tabularSections>
    <name>ПодобранныеПакеты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыНаВнешнихСкладахСерии/алк_ЗапасыНаВнешнихСкладахСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыНаВнешнихСкладахСерии</name>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/DataProcessors/алк_ПодборПакетов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Подбор в документ " + Параметры.Документ;	
	
	СписокПодбора.Параметры.УстановитьЗначениеПараметра("Склад",  Параметры.Склад);
	СписокПодбора.Параметры.УстановитьЗначениеПараметра("Ячейка", Параметры.Ячейка);
	СписокПодбора.Параметры.УстановитьЗначениеПараметра("СписокКатегорий", Параметры.СписокКатегорий.ВыгрузитьЗначения());
	
	Если Параметры.Свойство("П1") Тогда
		Если Параметры.П1 = 2 Тогда
			СписокПодбора.ТекстЗапроса =
			"ВЫБРАТЬ
			|	алк_ПараметрыХарактеристик.Порода,
			|	алк_ПараметрыХарактеристик.Сорт,
			|	алк_ПараметрыХарактеристик.Длина,
			|	алк_ПараметрыХарактеристик.Сечение,
			|	алк_ПараметрыХарактеристик.Влажность,
			|	ЕСТЬNULL(алк_ЗапасыНаВнешнихСкладахСерииОстатки.КоличествоПакетовОстаток, 0) КАК КоличествоПакетов,
			|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
			|	алк_ЗапасыНаВнешнихСкладахСерииОстатки.СерийныйНомер КАК Ссылка,
			|	алк_ЗапасыНаВнешнихСкладахСерииОстатки.СерийныйНомер.Владелец КАК Владелец,
			|	алк_ЗапасыНаВнешнихСкладахСерииОстатки.СерийныйНомер.Наименование КАК Наименование
			|ИЗ
			|	РегистрНакопления.алк_ЗапасыНаВнешнихСкладахСерии.Остатки(
			|			,
			|			СтруктурнаяЕдиница = &Склад
			|				И Ячейка = &Ячейка) КАК алк_ЗапасыНаВнешнихСкладахСерииОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
			|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
			|		ПО алк_ЗапасыНаВнешнихСкладахСерииОстатки.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
			|ГДЕ
			|	алк_ЗапасыНаВнешнихСкладахСерииОстатки.КоличествоПакетовОстаток > 0
			|	И алк_ЗапасыНаВнешнихСкладахСерииОстатки.Номенклатура.КатегорияНоменклатуры В(&СписокКатегорий)";
			
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПодобранныеПакетыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодбораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокПодбора.ТекущиеДанные;
	
	Если Истина Тогда
		
		СтандартнаяОбработка = Ложь;
		ДобавитьСтроку(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПиФ

&НаКлиенте
Процедура ДобавитьСтроку(ТекущиеДанные)
	
	ПараметрыОтбора = Новый Структура("СерийныйНомер", ТекущиеДанные.Ссылка);
	
	МассивСтрок = Объект.ПодобранныеПакеты.НайтиСтроки(ПараметрыОтбора);
	
	Если МассивСтрок.Количество() = 0 Тогда
		
		НовСтр = Объект.ПодобранныеПакеты.Добавить();
		НовСтр.СерийныйНомер = ТекущиеДанные.Ссылка;
		
		НовСтр.Номенклатура = ТекущиеДанные.Владелец;
		НовСтр.КоличествоПакетов = 1;
		
	КонецЕсли; 
	
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПересчитатьСумму");
	//
	//ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НовСтр, СтруктураДействий);
	//
	//Элементы.ПодобраннаяНоменклатура.ТекущаяСтрока = НовСтр.ПолучитьИдентификатор();
	
КонецПроцедуры // ДобавитьСтроку()

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()

	ТаблицаЗначений = Объект.ПодобранныеПакеты.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначений, УникальныйИдентификатор);	

КонецФункции // ПоместитьДанныеВоВременноеХранилище()


#КонецОбласти 


#Область ОбработчикаКоманд

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)

	АдресВХранилище = ПоместитьДанныеВоВременноеХранилище();
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("АдресПодобранныхДанныхВХранилище", АдресВХранилище);
	
	ОповеститьОВыборе(СтруктураОповещения);	
	
КонецПроцедуры

	
#КонецОбласти 


Процедура Конец()		
КонецПроцедуры
